<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'နာမည်',
    'column.guard_name' => 'Guard နာမည်',
    'column.team' => 'အဖွဲ့',
    'column.roles' => 'ရာထူးများ',
    'column.permissions' => 'ခွင့်ပြုချက်များ',
    'column.updated_at' => 'နောက်ဆုံးပြင်ဆင်ချိန်',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'နာမည်',
    'field.guard_name' => 'Guard နာမည်',
    'field.permissions' => 'ခွင့်ပြုချက်များ',
    'field.team' => 'အဖွဲ့',
    'field.team.placeholder' => 'အဖွဲ့ကိုရွေးချယ်ပါ...',
    'field.select_all.name' => 'အားလုံးရွေးချယ်မည်',
    'field.select_all.message' => 'ဤရာထူးအတွက် ခွင့်ပြုချက်အားလုံးကို ဖွင့်/ပိတ် လုပ်နိုင်သည်',
    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'Filament Shield',
    'nav.role.label' => 'ရာထူးများ',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'ရာထူး',
    'resource.label.roles' => 'ရာထူးများ',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'အခြေအနေများ',
    'resources' => 'အရင်းအမြစ်များ',
    'widgets' => 'Widgets',
    'pages' => 'စာမျက်နှာများ',
    'custom' => 'စိတ်ကြိုက် ခွင့်ပြုချက်များ',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'ဤစာမျက်နှာသို့ ဝင်ရောက်ခွင့်မရှိပါ',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'View',
        'view_any' => 'View Any',
        'create' => 'Create',
        'update' => 'Update',
        'delete' => 'Delete',
        'delete_any' => 'Delete Any',
        'force_delete' => 'Force Delete',
        'force_delete_any' => 'Force Delete Any',
        'restore' => 'Restore',
        'reorder' => 'Reorder',
        'restore_any' => 'Restore Any',
        'replicate' => 'Replicate',

        'view' => 'ကြည့်ရှု',
        'view_any' => 'မည်သည့်အရာမဆို ကြည့်ရှု',
        'create' => 'ဖန်တီး',
        'update' => 'ပြင်ဆင်',
        'delete' => 'ဖျက်',
        'delete_any' => 'မည်သည့်အရာမဆို ဖျက်',
        'force_delete' => 'အပြီးတိုင် ဖျက်',
        'force_delete_any' => 'မည်သည့်အရာမဆို အပြီးတိုင် ဖျက်',
        'restore' => 'ပြန်လည်ထည့်သွင်း',
        'reorder' => 'အစီအစဉ်ပြန်စီ',
        'restore_any' => 'မည်သည့်အရာမဆို ပြန်လည်ထည့်သွင်း',
        'replicate' => 'ပုံတူပြုလုပ်',
    ],
];
