<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'Ном',
    'column.guard_name' => 'Номи Guard',
    'column.roles' => 'Нақшҳо',
    'column.permissions' => 'Иҷозатҳо',
    'column.updated_at' => 'Навсозӣ шудааст',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'Ном',
    'field.guard_name' => 'Номи Guard',
    'field.permissions' => 'Иҷозатҳо',
    'field.select_all.name' => 'Ҳамаро интихоб кунед',
    'field.select_all.message' => 'Ҳамаи иҷозатҳое, ки барои ин нақш <span class="text-primary font-medium">дастрас мебошанд</span>, фаъол карда шаванд',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'Filament Shield',
    'nav.role.label' => 'Нақшҳо',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'Нақш',
    'resource.label.roles' => 'Нақшҳо',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'Моҳиятҳо',
    'resources' => 'Захираҳо',
    'widgets' => 'Виҷетҳо',
    'pages' => 'Саҳифаҳо',
    'custom' => 'Иҷозатҳои фармоишӣ',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'Шумо дастрасӣ надоред',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'Намоиш',
        'view_any' => 'Намоиши ҳамаи сабтҳо',
        'create' => 'Эҷод',
        'update' => 'Навсозӣ',
        'delete' => 'Ҳазф',
        'delete_any' => 'Ҳазфи ҳамаи сабтҳо',
        'force_delete' => 'Ҳазфи доимӣ',
        'force_delete_any' => 'Ҳазфи доимии ҳамаи сабтҳо',
        'restore' => 'Барқарорсозӣ',
        'reorder' => 'Тағйири тартиб',
        'restore_any' => 'Барқарорсозии ҳамаи сабтҳо',
        'replicate' => 'Нусхабардорӣ',
    ],
];
