<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'الإسم',
    'column.guard_name' => 'اسم الحارس',
    'column.roles' => 'الصلاحية',
    'column.permissions' => 'الأذونات',
    'column.updated_at' => 'تاريخ التحديث',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'الإسم',
    'field.guard_name' => 'اسم الحارس',
    'field.permissions' => 'الأذونات',
    'field.select_all.name' => 'تحديد الكل',
    'field.select_all.message' => 'تفعيل كافة الأذونات لهذه الصلاحية',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'الصلاحيات',
    'nav.role.label' => 'الصلاحيات',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'صلاحية',
    'resource.label.roles' => 'الصلاحيات',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */
    'section' => 'الوحدات',
    'resources' => 'المصادر',
    'widgets' => 'الملحقات',
    'pages' => 'الصفحات',
    'custom' => 'أذونات مخصصة',

    /**
     * HasPageShield Trait Forbidden Message
     */
    'forbidden' => 'عذراً، ليست لديك صلاحية تنفيذ هذا الإجراء',
];
