<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'ناو',
    'column.guard_name' => 'ناوی گوارد',
    'column.roles' => 'ڕۆڵەکان',
    'column.permissions' => 'پێرمشنەکان',
    'column.updated_at' => 'نوێکردنەوە لە',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'ناو',
    'field.guard_name' => 'ناوی گوارد',
    'field.permissions' => 'پێرمشنەکان',
    'field.select_all.name' => 'دیاری کردنی هەموو',
    'field.select_all.message' => 'هەموو پێرمشنەکان چالاک بکە کە لە ئێستادا <span class="font-medium text-primary">چالاک کراوە</span> بۆ ئەم ڕۆڵە',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'فیڵەمێنت شیڵد',
    'nav.role.label' => 'ڕۆڵەکان',
    'nav.role.icon' => 'heroicon-o-users',
    'resource.label.role' => 'ڕۆڵ',
    'resource.label.roles' => 'ڕۆڵەکان',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'یەکەکان',
    'resources' => 'سەرچاوەکان',
    'widgets' => 'ویجتەکان',
    'pages' => 'پەیجەکان',
    'custom' => 'پێرمشنی تایبەت',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'تۆ مۆڵەتی چوونە ژوورەوەت نییە',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'بینین',
        'view_any' => 'بینینی هەریەک',
        'create' => 'دروستکردن',
        'update' => 'نوێکردنەوە',
        'delete' => 'سڕینەوە',
        'delete_any' => 'سڕینەوەی هەریەک',
        'force_delete' => 'سڕینەوەی تەواو',
        'force_delete_any' => 'سڕینەوەی تەواوی هەریەک',
        'restore' => 'گێڕاندنەوە',
        'reorder' => 'ڕیزکردن',
        'restore_any' => 'گێڕاندنەوەی هەریەک',
        'replicate' => 'دووبارەکردنەوە',
    ],
];
