<?php

return [
    /*
    |------------------------------------------------- -------------------------
    | Table Columns
    |------------------------------------------------- -------------------------
    */

    'column.name' => 'Назва',
    'column.guard_name' => 'Назва гварда',
    'column.roles' => 'Ролі',
    'column.permissions' => 'Дозволи',
    'column.updated_at' => 'Оновлено',

    /*
    |------------------------------------------------- -------------------------
    | Form Fields
    |------------------------------------------------- -------------------------
    */

    'field.name' => 'Назва',
    'field.guard_name' => 'Назва гварда',
    'field.permissions' => 'Дозволи',
    'field.select_all.name' => 'Вибрати все',
    'field.select_all.message' => 'Включити всі дозволи, які <span class="text-primary font-medium">Доступні</span> для цієї ролі',

    /*
    |------------------------------------------------- -------------------------
    | Navigation & Resource
    |------------------------------------------------- -------------------------
    */

    'nav.group' => 'Filament Shield',
    'nav.role.label' => 'Ролі',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'Роль',
    'resource.label.roles' => 'Ролі',

    /*
    |------------------------------------------------- -------------------------
    | Section & Tabs
    |------------------------------------------------- -------------------------
    */

    'section' => 'Сутності',
    'resources' => 'Ресурси',
    'widgets' => 'Віджети',
    'pages' => 'Сторінки',
    'custom' => 'Користувальницькі дозволи',

    /*
    |------------------------------------------------- -------------------------
    | Messages
    |------------------------------------------------- -------------------------
    */

    'forbidden' => 'У вас немає доступу',

    /*
    |------------------------------------------------- -------------------------
    | Resource Permissions' Labels
    |------------------------------------------------- -------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'Перегляд',
        'view_any' => 'Перегляд будь-якого',
        'create' => 'Створити',
        'update' => 'Оновити',
        'delete' => 'Видалити',
        'delete_any' => 'Видалити будь-яке',
        'force_delete' => 'Примусове видалення',
        'force_delete_any' => 'Примусове видалення будь-якого',
        'restore' => 'Відновити',
        'reorder' => 'Змінити порядок',
        'restore_any' => 'Відновити будь-яке',
        'replicate' => 'Копіювати',
    ],
];
